http_server3_performance.txt
============================================================================
ab -n 1000 -c 10 http://172.16.209.44/
============================================================================

This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.16.209.44 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:        
Server Hostname:        172.16.209.44
Server Port:            80

Document Path:          /
Document Length:        1401 bytes

Concurrency Level:      10
Time taken for tests:   0.443 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      1467000 bytes
HTML transferred:       1401000 bytes
Requests per second:    2256.94 [#/sec] (mean)
Time per request:       4.431 [ms] (mean)
Time per request:       0.443 [ms] (mean, across all concurrent requests)
Transfer rate:          3233.33 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   1.1      1       7
Processing:     1    3   1.7      2      11
Waiting:        0    2   1.4      2      10
Total:          2    4   2.1      4      17

Percentage of the requests served within a certain time (ms)
  50%      4
  66%      5
  75%      5
  80%      6
  90%      7
  95%      8
  98%     11
  99%     14
 100%     17 (longest request)

============================================================================
ab -n 10000 -c 20 http://172.16.209.44/
============================================================================

This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.16.209.44 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        
Server Hostname:        172.16.209.44
Server Port:            80

Document Path:          /
Document Length:        1401 bytes

Concurrency Level:      20
Time taken for tests:   7.856 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      14670000 bytes
HTML transferred:       14010000 bytes
Requests per second:    1272.96 [#/sec] (mean)
Time per request:       15.711 [ms] (mean)
Time per request:       0.786 [ms] (mean, across all concurrent requests)
Transfer rate:          1823.66 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        1    8   2.0      7      23
Processing:     2    8   1.8      8      21
Waiting:        0    8   1.8      8      20
Total:          6   16   2.2     16      43

Percentage of the requests served within a certain time (ms)
  50%     16
  66%     16
  75%     17
  80%     17
  90%     18
  95%     19
  98%     22
  99%     24
 100%     43 (longest request)